Repository: pingfangx/TranslatorX-other
Catalog: JavaDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Replaces all linked nodes in bin at index for given hash unless table is too small, in which case resizes instead.
zh_cn: 替换给定 hash 对应的索引的桶中所有的链接节点，除非表太小，在这种情况下用 resize 代替。

source: Replaces each entry's value with the result of invoking the given function on that entry until all entries have been processed or the function throws an exception.
zh_cn: 将每个项的值替换为对该项调用给定函数的结果，直到处理完所有项或函数引发异常。

source: Replaces each substring of this string that matches the given regular expression with the given replacement.
zh_cn: 使用给定的 replacement 替换此字符串所有匹配给定的正则表达式的子字符串。

source: Replaces each substring of this string that matches the literal target sequence with the specified literal replacement sequence.
zh_cn: 使用指定的字面值替换序列替换此字符串所有匹配字面值目标序列的子字符串。

source: Replaces the characters in a substring of this sequence with characters in the specified String.
zh_cn: 使用给定 String 中的字符替换此序列的子字符串中的字符。

source: Replaces the entry for the specified key only if currently mapped to the specified value.
zh_cn: 仅当当前映射到指定值时，才替换指定键的项。

source: Replaces the entry for the specified key only if it is currently mapped to some value.
zh_cn: 仅当指定项当前映射到某个值时，才替换该项。

source: Replaces the first substring of this string that matches the given regular expression with the given replacement.
zh_cn: 使用给定的 replacement 替换此字符串匹配给定的正则表达式的第一个子字符串。

source: Represent channels for retrieving resources from the ResponseCache.
zh_cn: 表示从 ResponseCache 获取资源的通道。

source: Represents a Uniform Resource Identifier (URI) reference.
zh_cn: 表示一个统一资源标识符 (URI) 引用。

source: Represents a cache response originally retrieved through secure means, such as TLS.
zh_cn: 表示最初通过安全方法（如 TLS）获得的缓存响应。

source: Represents a currency.
zh_cn: 表示货币。

source: Represents a family of communication protocols.
zh_cn: 代表一个家族的通信协议。

source: Represents an annotated element of the program currently running in this VM.
zh_cn: 表示目前正在此 VM 中运行的程序的一个已注释元素。

source: Represents an annotated element of the program currently running in this VM. This interface allows annotations to be read reflectively.
zh_cn: 表示目前正在此 VM 中运行的程序的一个已注释元素。该接口允许反射性地读取注释。

source: Represents channels for storing resources in the ResponseCache.
zh_cn: 表示在 ResponseCache 中存储资源的通道。

source: Represents implementations of URLConnection caches.
zh_cn: 表示 URLConnection 缓存的实现。

source: Represents the proxy type.
zh_cn: 表示代理类型。

source: Reset to initial default state.
zh_cn: 重置为初始默认状态。

source: Resizable-array implementation of the Deque interface.
zh_cn: Deque 接口的大小可变数组的实现。

source: Resizable-array implementation of the List interface.
zh_cn: List 接口的大小可变数组的实现。

source: Resource bundles contain locale-specific objects.
zh_cn: 资源包包含特定于语言环境的对象。

source: Return d × 2scaleFactor rounded as if performed by a single correctly rounded floating-point multiply to a member of the double value set.
zh_cn: 返回 d × 2scaleFactor，其舍入方式如同将一个正确舍入的浮点值乘以 double 值集合中的一个值。

source: Return f × 2scaleFactor rounded as if performed by a single correctly rounded floating-point multiply to a member of the float value set.
zh_cn: 返回 f × 2scaleFactor，其舍入方式如同将一个正确舍入的浮点值乘以 float 值集合中的一个值。

source: Return true if the integer argument includes the abstract modifier, false otherwise.
zh_cn: 如果整数参数包括 abstract 修饰符，则返回 true，否则返回 false。

source: Return true if the integer argument includes the final modifier, false otherwise.
zh_cn: 如果整数参数包括 final 修饰符，则返回 true，否则返回 false。

source: Return true if the integer argument includes the interface modifier, false otherwise.
zh_cn: 如果整数参数包括 interface 修饰符，则返回 true，否则返回 false。

source: Return true if the integer argument includes the native modifier, false otherwise.
zh_cn: 如果整数参数包括 native 修饰符，则返回 true，否则返回 false。

source: Return true if the integer argument includes the private modifier, false otherwise.
zh_cn: 如果整数参数包括 private 修饰符，则返回 true，否则返回 false。

source: Return true if the integer argument includes the protected modifier, false otherwise.
zh_cn: 如果整数参数包括 protected 修饰符，则返回 true，否则返回 false。

source: Return true if the integer argument includes the public modifier, false otherwise.
zh_cn: 如果整数参数包括 public 修饰符，则返回 true，否则返回 false。

source: Return true if the integer argument includes the static modifier, false otherwise.
zh_cn: 如果整数参数包括 static 修饰符，则返回 true，否则返回 false。

source: Return true if the integer argument includes the strictfp modifier, false otherwise.
zh_cn: 如果整数参数包括 strictfp 修饰符，则返回 true，否则返回 false。

source: Return true if the integer argument includes the synchronized modifier, false otherwise.
zh_cn: 如果整数参数包括 synchronized 修饰符，则返回 true，否则返回 false。

source: Return true if the integer argument includes the transient modifier, false otherwise.
zh_cn: 如果整数参数包括 transient 修饰符，则返回 true，否则返回 false。

source: Return true if the integer argument includes the volatile modifier, false otherwise.
zh_cn: 如果整数参数包括 volatile 修饰符，则返回 true，否则返回 false。

source: Return a string describing the access modifier flags in the specified modifier.
zh_cn: 返回描述指定修饰符中的访问修饰符标志的字符串。

source: Return an int value OR-ing together the source language modifiers that can be applied to a class.
zh_cn: 返回一个 int 值，其值是可以被应用到类的源语言修饰符异或到一起。

source: Return an int value OR-ing together the source language modifiers that can be applied to a constructor.
zh_cn: 返回一个 int 值，其值是可以被应用到构造函数的源语言修饰符异或到一起。

source: Return an int value OR-ing together the source language modifiers that can be applied to a field.
zh_cn: 返回一个 int 值，其值是可以被应用到字段的源语言修饰符异或到一起。

source: Return an int value OR-ing together the source language modifiers that can be applied to a method.
zh_cn: 返回一个 int 值，其值是可以被应用到方法的源语言修饰符异或到一起。

source: Return an int value OR-ing together the source language modifiers that can be applied to an interface.
zh_cn: 返回一个 int 值，其值是可以被应用到接口的源语言修饰符异或到一起。

source: Returns true if all tasks have completed following shut down.
zh_cn: 如果关闭后所有任务都已完成，则返回 true。

source: Returns true if and only if the argument is not null and is a Boolean object that represents the same boolean value as this object.
zh_cn: 当且仅当参数不是 null，而是一个与此对象一样，都表示同一个 Boolean 值的 boolean 对象时，才返回 true。

source: Returns true if and only if the system property named by the argument exists and is equal to the string "true".
zh_cn: 当且仅当以参数命名的系统属性存在，且等于 "true" 字符串时，才返回 true。

source: Returns true if and only if the underlying class is a local class.
zh_cn: 当且仅当底层类是本地类时返回 true。

source: Returns true if and only if the underlying class is a member class.
zh_cn: 当且仅当底层类是成员类时返回 true。

source: Returns true if and only if the underlying class is an anonymous class.
zh_cn: 当且仅当底层类是匿名类时返回 true。

source: Returns true if the argument is a finite floating-point value; returns false otherwise (for NaN and infinity arguments).
zh_cn: 如果参数是有限浮点值，则返回 true；否则返回 false(对于 NaN 和无穷大参数)。

source: Returns true if the specified number is a Not-a-Number (NaN) value, false otherwise.
zh_cn: 如果指定的数是一个非数字 (NaN) 值，则返回 true，否则返回 false。

source: Returns true if the specified number is infinitely large in magnitude, false otherwise.
zh_cn: 如果指定数的数值是无穷大，则返回 true，否则返回 false。

source: Returns true if this Double value is a Not-a-Number (NaN), false otherwise.
zh_cn: 如果此 Double 值是非数字（NaN）值，则返回 true；否则返回 false。

source: Returns true if this Double value is infinitely large in magnitude, false otherwise.
zh_cn: 如果此 Double 值在数值上为无穷大，则返回 true；否则返回 false。

source: Returns true if this Float value is a Not-a-Number (NaN), false otherwise.
zh_cn: 如果此 Float 值是一个非数字 (NaN) 值，则返回 true，否则返回 false。

source: Returns true if this Float value is infinitely large in magnitude, false otherwise.
zh_cn: 如果此 Float 值的大小是无穷大，则返回 true，否则返回 false。

source: Returns true if this class is a synthetic class; returns false otherwise.
zh_cn: 如果此类是复合类，则返回 true，否则 false。

source: Returns true if this constructor is a synthetic constructor; returns false otherwise.
zh_cn: 如果此构造方法是一个复合构造方法，则返回 true；否则返回 false。

source: Returns true if this constructor was declared to take a variable number of arguments; returns false otherwise.
zh_cn: 如果声明此构造方法可以带可变数量的参数，则返回 true；否则返回 false。

source: Returns true if this executor has been shut down.
zh_cn: 如果此执行程序已关闭，则返回 true。

source: Returns true if this field is a synthetic field; returns false otherwise.
zh_cn: 如果此字段是复合字段，则返回 true；否则返回 false。

source: Returns true if this field represents an element of an enumerated type; returns false otherwise.
zh_cn: 如果此字段表示枚举类型的元素，则返回 true；否则返回 false。

source: Returns true if this map contains a mapping for the specified key.
zh_cn: 如果此映射包含对于指定键的映射关系，则返回 true。

source: Returns true if this map contains no key-value mappings.
zh_cn: 如果此映射不包含键-值映射关系，则返回 true。

source: Returns true if this map maps one or more keys to the specified value.
zh_cn: 如果此映射将一个或多个键映射到指定值，则返回 true。

source: Returns true if this member was introduced by the compiler; returns false otherwise.
zh_cn: 如果此成员是编译器引入的，则返回 true；否则，返回 false。

source: Returns true if this method is a bridge method; returns false otherwise.
zh_cn: 如果此方法是 bridge 方法，则返回 true；否则，返回 false。

source: Returns true if this method is a default method; returns false otherwise.
zh_cn: 如果此方法是默认方法，则返回 true；否则，返回 false。

source: Returns true if this method is a synthetic method; returns false otherwise.
zh_cn: 如果此方法为复合方法，则返回 true；否则，返回 false。

source: Returns true if this method was declared to take a variable number of arguments; returns false otherwise.
zh_cn: 如果将此方法声明为带有可变数量的参数，则返回 true；否则，返回 false。

source: Returns ex -1.
zh_cn: 返回 ex -1。

source: Returns true if and only if the current thread holds the monitor lock on the specified object.
zh_cn: 当且仅当当前线程在指定的对象上保持监视器锁时，才返回 true。

source: Returns true if, and only if, length() is 0.
zh_cn: 当且仅当 length() 为 0 时返回 true。

source: Returns Euler's number e raised to the power of a double value.
zh_cn: 返回欧拉数 e 的 double 次幂的值。

source: Returns a Collection view of the values contained in this map.
zh_cn: 返回此映射所包含的值的 Collection 视图。

source: Returns a Set view of the keys contained in this map.
zh_cn: 返回此映射中所包含的键的 Set 视图。

source: Returns a Set view of the mappings contained in this map.
zh_cn: 返回此映射所包含的映射关系的 Set 视图。

source: Returns a Boolean instance representing the specified boolean value.
zh_cn: 返回一个表示指定 boolean 值的 Boolean 实例。

source: Returns a Boolean with a value represented by the specified string.
zh_cn: 返回一个用指定的字符串表示值的 Boolean 值。

source: Returns a Byte instance representing the specified byte value.
zh_cn: 返回表示指定 byte 值的一个 Byte 实例。

source: Returns a Byte object holding the value extracted from the specified String when parsed with the radix given by the second argument.
zh_cn: 返回一个 Byte 对象，该对象保持从指定的 String 中提取的值，该值是在用第二个参数所给定的基数对指定字符串进行解析时提取的。

source: Returns a Byte object holding the value given by the specified String.
zh_cn: 返回一个保持指定 String 所给出的值的 Byte 对象。

source: Returns a Class object that identifies the declared type for the field represented by this Field object.
zh_cn: 返回一个 Class 对象，它标识了此 Field 对象所表示字段的声明类型。

source: Returns a Class object that represents the formal return type of the method represented by this Method object.
zh_cn: 返回一个 Class 对象，该对象描述了此 Method 对象所表示的方法的正式返回类型。

source: Returns a Constructor object that reflects the specified constructor of the class or interface represented by this Class object.
zh_cn: 返回一个 Constructor 对象，该对象反映此 Class 对象所表示的类或接口的指定构造方法。

source: Returns a Constructor object that reflects the specified public constructor of the class represented by this Class object.
zh_cn: 返回一个 Constructor 对象，它反映此 Class 对象所表示的类的指定公共构造方法。

source: Returns a Double instance representing the specified double value.
zh_cn: 返回表示指定的 double 值的 Double 实例。

source: Returns a Double object holding the double value represented by the argument string s.
zh_cn: 返回保存用参数字符串 s 表示的 double 值的 Double 对象。

source: Returns a Field object that reflects the specified declared field of the class or interface represented by this Class object.
zh_cn: 返回一个 Field 对象，该对象反映此 Class 对象所表示的类或接口的指定已声明字段。

source: Returns a Field object that reflects the specified public member field of the class or interface represented by this Class object.
zh_cn: 返回一个 Field 对象，它反映此 Class 对象所表示的类或接口的指定公共成员字段。

source: Returns a Float instance representing the specified float value.
zh_cn: 返回表示指定的 float 值的 Float 实例。

source: Returns a Float object holding the float value represented by the argument string s.
zh_cn: 返回保存用参数字符串 s 表示的 float 值的 Float 对象。

source: Returns a Long instance representing the specified long value.
zh_cn: 返回表示指定 long 值的 Long 实例。

source: Returns a Long object holding the value extracted from the specified String when parsed with the radix given by the second argument.
zh_cn: 当使用第二个参数给出的基数进行解析时，返回保持从指定 String 中提取的值的 Long 对象。

source: Returns a Long object holding the value of the specified String.
zh_cn: 返回保持指定 String 的值的 Long 对象。

source: Returns a Method object that reflects the specified declared method of the class or interface represented by this Class object.
zh_cn: 返回一个 Method 对象，该对象反映此 Class 对象所表示的类或接口的指定已声明方法。

source: Returns a Method object that reflects the specified public member method of the class or interface represented by this Class object.
zh_cn: 返回一个 Method 对象，它反映此 Class 对象所表示的类或接口的指定公共成员方法。

source: Returns a RunnableFuture for the given callable task.
zh_cn: 为给定可调用任务返回一个 RunnableFuture。

source: Returns a RunnableFuture for the given runnable and default value.
zh_cn: 为给定可运行任务和默认值返回一个 RunnableFuture。

source: Returns a Short instance representing the specified short value.
zh_cn: 返回表示指定 short 值的 Short 实例。

source: Returns a Short object holding the value extracted from the specified String when parsed with the radix given by the second argument.
zh_cn: 返回一个 Short 对象，该对象保持从指定的 String 中提取的值，该值是在使用第二个参数给出的基数对指定字符串进行解析时提取的。

source: Returns a Short object holding the value given by the specified String.
zh_cn: 返回一个保持指定 String 所给出的值的 Short 对象。

source: Returns a String object representing the specified char.
zh_cn: 返回一个表示指定 char 值的 String 对象。

source: Returns a String object representing the specified long.
zh_cn: 返回表示指定 long 的 String 对象。

source: Returns a String object representing the specified boolean.
zh_cn: 返回一个表示指定布尔值的 String 对象。

source: Returns a String object representing the specified integer.
zh_cn: 返回一个表示指定整数的 String 对象。

source: Returns a String object representing this Byte's value.
zh_cn: 返回表示 Long 值的 String 对象。

source: Returns a String object representing this Character's value.
zh_cn: 返回表示此 Character 值的 String 对象。

source: Returns a String object representing this Integer's value.
zh_cn: 返回一个表示该 Integer 值的 String 对象。

source: Returns a String object representing this Long's value.
zh_cn: 返回表示 Long 值的 String 对象。

source: Returns a String object representing this Short's value.
zh_cn: 返回表示此 Short 的值的 String 对象。

source: Returns a String object representing this Boolean's value.
zh_cn: 返回表示该布尔值的 String 对象。

source: Returns a Type object representing the component type of this array.
zh_cn: 返回表示此数组的组件类型的 Type 对象。

source: Returns a Type object representing the type that this type is a member of.
zh_cn: 返回 Type 对象，表示此类型是其成员之一的类型。

source: Returns a Type object that represents the declared type for the field represented by this Field object.
zh_cn: 返回一个 Type 对象，它表示此 Field 对象所表示字段的声明类型。

source: Returns a Type object that represents the formal return type of the method represented by this Method object.
zh_cn: 返回表示由此 Method 对象所表示方法的正式返回类型的 Type 对象。

source: Returns a double value with a positive sign, greater than or equal to 0.0 and less than 1.0.
zh_cn: 返回带正号的 double 值，该值大于等于 0.0 且小于 1.0。

source: Returns a long value with at most a single one-bit, in the position of the highest-order ("leftmost") one-bit in the specified long value.
zh_cn: 返回至多有一个 1 位的 long 值，在指定的 long 值中最高位（最左边）的 1 位的位置。

source: Returns a long value with at most a single one-bit, in the position of the lowest-order ("rightmost") one-bit in the specified long value.
zh_cn: 返回至多有一个 1 位的 long 值，在指定的 long 值中最低位（最右边）的 1 位的位置。

source: Returns a Character instance representing the specified char value.
zh_cn: 返回一个表示指定 char 值的 Character 实例。

source: Returns a Package that has been defined by this class loader or any of its ancestors.
zh_cn: 返回由此类加载器或其任何祖先所定义的 Package。

source: Returns a String that represents the character sequence in the array specified.
zh_cn: 返回指定数组中表示该字符序列的 String。

source: Returns a canonical representation for the string object.
zh_cn: 返回字符串对象的规范化表示形式。

source: Returns a copy of the string, with leading and trailing whitespace omitted.
zh_cn: 返回字符串的副本，忽略前导空白和尾部空白。

source: Returns a directly or indirectly present list of annotations on this element, whose class is annotationClass, or an empty array if nothing was found.
zh_cn: 返回 this 元素上直接或间接存在的注释列表，其类是 annotationClass，如果未找到任何内容，则返回空数组。

source: Returns a directly-present annotation on this element, whose class is annotationClass, or null if nothing was found.
zh_cn: 返回在 this 元素上直接存在的注释，其类为 annotationClass，如果未找到任何内容，则返回 null。

source: Returns a formatted string using the specified format string and arguments.
zh_cn: 使用指定的格式字符串和参数返回一个格式化字符串。

source: Returns a formatted string using the specified locale, format string, and arguments.
zh_cn: 使用指定的语言环境、格式字符串和参数返回一个格式化字符串。

source: Returns a hash code for a boolean value; compatible with Boolean.hashCode().
zh_cn: 返回一个 boolean 值的哈希码；兼容 Boolean.hashCode()。

source: Returns a hash code for a byte value; compatible with Byte.hashCode().
zh_cn: 返回一个 byte 值的哈希码；兼容 Byte.hashCode()。

source: Returns a hash code for a char value; compatible with Character.hashCode().
zh_cn: 返回一个 char 值的哈希码；兼容 Character.hashCode()。

source: Returns a hash code for a double value; compatible with Double.hashCode().
zh_cn: 返回一个 double 值的哈希码；兼容 Double.hashCode()。

source: Returns a hash code for a float value; compatible with Float.hashCode().
zh_cn: 返回一个 float 值的哈希码；兼容 Float.hashCode()。

source: Returns a hash code for a int value; compatible with Integer.hashCode().
zh_cn: 返回一个 int 值的哈希码；兼容 Integer.hashCode()。

source: Returns a hash code for a long value; compatible with Long.hashCode().
zh_cn: 返回一个 long 值的哈希码；兼容 Long.hashCode()。

source: Returns a hash code for a short value; compatible with Short.hashCode().
zh_cn: 返回一个 short 值的哈希码；兼容 Short.hashCode()。

source: Returns a hash code for this Boolean object.
zh_cn: 返回该 Boolean 对象的哈希码。

source: Returns a hash code for this Byte; equal to the result of invoking intValue().
zh_cn: 返回此 Byte 的哈希码；等于调用 intValue() 的结果。

source: Returns a hash code for this Character; equal to the result of invoking charValue().
zh_cn: 返回此 Character 的哈希码；等于调用 charValue() 的结果。

source: Returns a hash code for this Double object.
zh_cn: 返回此 Double 对象的哈希码。

source: Returns a hash code for this Float object.
zh_cn: 返回此 Float 对象的哈希码。

source: Returns a hash code for this Integer.
zh_cn: 返回此 Integer 的哈希码。

source: Returns a hash code for this Long.
zh_cn: 返回 Long 的哈希码。

source: Returns a hash code for this Short; equal to the result of invoking intValue().
zh_cn: 返回此 Short 的哈希码；等于调用 intValue() 的结果。

source: Returns a hash code for this enum constant.
zh_cn: 返回枚举常量的哈希码。

source: Returns a hash code for this string.
zh_cn: 返回此字符串的哈希码。

source: Returns a hash code value for the object.
zh_cn: 返回该对象的哈希码值。

source: Returns a hash code value for this stack trace element.
zh_cn: 返回此堆栈跟踪元素的哈希码值。

source: Returns a hashcode for this Constructor.
zh_cn: 返回此 Constructor 的哈希码。

source: Returns a hashcode for this Field.
zh_cn: 返回该 Field 的哈希码。

source: Returns a hashcode for this Method.
zh_cn: 返回此 Method 的哈希码。

source: Returns a hexadecimal string representation of the double argument.
zh_cn: 返回 double 参数的十六进制字符串表示形式。

source: Returns a hexadecimal string representation of the float argument.
zh_cn: 返回 float 参数的十六进制字符串表示形式。

source: Returns a list of non-TreeNodes replacing those linked from this node.
zh_cn: 返回非 TreeNodes 的列表，替换从此节点链接的列表。

source: Returns a map of stack traces for all live threads.
zh_cn: 返回所有活动线程的堆栈跟踪的一个映射。

source: Returns a negative integer, zero, or a positive integer as this object is less than, equal to, or greater than the specified object.
zh_cn: 在该对象小于、等于或大于指定对象时，分别返回负整数、零或正整数。

source: Returns a new CharSequence that is a subsequence of this sequence.
zh_cn: 返回一个新的 CharSequence，它是此序列的子序列。

source: Returns a new String object representing the specified byte.
zh_cn: 返回表示指定 byte 的一个新 String 对象。

source: Returns a new String object representing the specified short.
zh_cn: 返回表示指定 short 的一个新 String 对象。

source: Returns a new String that contains a subsequence of characters currently contained in this character sequence.
zh_cn: 返回一个新的 String，它包含此字符序列当前所包含的字符子序列。

source: Returns a new String that contains a subsequence of characters currently contained in this sequence.
zh_cn: 返回一个新的 String，它包含此序列当前所包含字符的子序列。

source: Returns a new double initialized to the value represented by the specified String, as performed by the valueOf method of class Double.
zh_cn: 返回一个新的 double 值，该值被初始化为用指定 String 表示的值，这与 Double 类的 valueOf 方法一样。

source: Returns a new float initialized to the value represented by the specified String, as performed by the valueOf method of class Float.
zh_cn: 返回一个新的 float 值，该值被初始化为用指定 String 表示的值，这与 Float 类的 valueOf 方法一样。

source: Returns a new character sequence that is a subsequence of this sequence.
zh_cn: 返回一个新的字符序列，它是此序列的一个子序列。

source: Returns a new string resulting from replacing all occurrences of oldChar in this string with newChar.
zh_cn: 返回一个新的字符串，它是通过用 newChar 替换此字符串中出现的所有 oldChar 得到的。

source: Returns a new string that is a substring of this string.
zh_cn: 返回一个新字符串，它是此字符串的一个子字符串。

source: Returns a power of two size for the given target capacity.
zh_cn: 为给定的目标容量返回 2 的幂的大小。

source: Returns a reference to the currently executing thread object.
zh_cn: 返回对当前正在执行的线程对象的引用。

source: Returns a representation of the specified floating-point value according to the IEEE 754 floating-point "double format" bit layout, preserving Not-a-Number (NaN) values.
zh_cn: 根据 IEEE 754 浮点“双精度格式”位布局，返回指定浮点值的表示形式，并保留 NaN 值。

source: Returns a representation of the specified floating-point value according to the IEEE 754 floating-point "double format" bit layout.
zh_cn: 根据 IEEE 754 浮点双精度格式 ("double format") 位布局，返回指定浮点值的表示形式。

source: Returns a representation of the specified floating-point value according to the IEEE 754 floating-point "single format" bit layout, preserving Not-a-Number (NaN) values.
zh_cn: 根据 IEEE 754 浮点“单一格式”位布局，返回指定浮点值的表示形式，并保留非数字 (NaN) 值。

source: Returns a representation of the specified floating-point value according to the IEEE 754 floating-point "single format" bit layout.
zh_cn: 根据 IEEE 754 浮点“单一格式”位布局，返回指定浮点值的表示形式。

source: Returns a shallow copy of this AbstractMap instance: the keys and values themselves are not cloned.
zh_cn: 返回此 AbstractMap 实例的浅表副本：不复制键和值本身。

source: Returns a shallow copy of this HashMap instance: the keys and values themselves are not cloned.
zh_cn: 返回此 HashMap 实例的浅表副本：并不复制键和值本身。

source: Returns a short description of this throwable.
zh_cn: 返回此 throwable 的简短描述。

source: Returns a stream of int zero-extending the char values from this sequence.
zh_cn: 返回此序列中的 char 值 zero-extending 的 int 流。

source: Returns a stream of code point values from this sequence.
zh_cn: 返回此序列的代码点值流。

source: Returns a string containing the characters in this sequence in the same order as this sequence.
zh_cn: 返回一个包含此序列中字符的字符串，该字符串与此序列的顺序相同。

source: Returns a string describing this Constructor, including type parameters.
zh_cn: 返回描述此 Constructor 的字符串，其中包括类型参数。

source: Returns a string describing this Constructor.
zh_cn: 返回描述此 Constructor 的字符串。

source: Returns a string describing this Field, including its generic type.
zh_cn: 返回一个描述此 Field（包括其一般类型）的字符串。

source: Returns a string describing this Field.
zh_cn: 返回一个描述此 Field 的字符串。

source: Returns a string describing this Method, including type parameters.
zh_cn: 返回描述此 Method 的字符串，包括类型参数。

source: Returns a string describing this Method.
zh_cn: 返回描述此 Method 的字符串。
